{
  "_name_or_path": "/kaggle/input/microsoftdeberta-v3-base/deberta-v3-base",
  "architectures": [
    "DebertaV2ForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "ADIS",
    "1": "ADV",
    "2": "AP",
    "3": "ATS-SIC",
    "4": "AcademicTechInnovation",
    "5": "AudioVisualDesign",
    "6": "BARS",
    "7": "BIA",
    "8": "BusinessIntelligence",
    "9": "CIOPS",
    "10": "Canvas",
    "11": "ClassroomSupport",
    "12": "CloudInfrastructure",
    "13": "CloudLabs",
    "14": "CollabSupport",
    "15": "CommunicationsAndOutreach",
    "16": "CoreBusinessApps",
    "17": "DataCenterTPC",
    "18": "DataIntegrationServices",
    "19": "DataMgmt",
    "20": "Datacomm",
    "21": "DigitalSignage",
    "22": "DuoSupport",
    "23": "ESignature",
    "24": "ETS-PodcastAdmin",
    "25": "ETS-SIC",
    "26": "EducationalInfrastructureSystems",
    "27": "EnrollmentManagement",
    "28": "EnterpriseSoftwareLicensing",
    "29": "FIM",
    "30": "FIS",
    "31": "FIS-Config",
    "32": "FieldSupport-Intake",
    "33": "HCM",
    "34": "HDH",
    "35": "Hostmaster",
    "36": "IAM-LastPass",
    "37": "ISSM",
    "38": "InstallationRepair",
    "39": "InstructionalComputingServices",
    "40": "Interfolio",
    "41": "KalturaVideo",
    "42": "KualiBuild",
    "43": "Library",
    "44": "MainFrame",
    "45": "MediaEvent",
    "46": "MessagingCollaboration",
    "47": "MultimediaServices",
    "48": "MyMobileBill",
    "49": "NetIntegrationServices",
    "50": "NetworkArchitecture",
    "51": "OIA-ADTeam",
    "52": "OIA-IAM-AccessProv",
    "53": "OIA-IAM-ShibSupport",
    "54": "OnBase",
    "55": "OnBase-PRA",
    "56": "OpenEdX-Online",
    "57": "Outsideplant-NodeRoom",
    "58": "ProSupport",
    "59": "ProductionControl",
    "60": "ProjectPortfolioMgmtOffice",
    "61": "Qualtrics",
    "62": "RIS",
    "63": "RMP",
    "64": "ResearchITServices",
    "65": "SDMI",
    "66": "SIS-AcademicAffairs",
    "67": "SIS-AcademicAffairs-ISA",
    "68": "SIS-ExIS",
    "69": "SIS-StudentAffairs",
    "70": "SNOW",
    "71": "SecuritySOC",
    "72": "ServiceDesk",
    "73": "ServiceOps",
    "74": "SharePointSupport",
    "75": "Splunk",
    "76": "TechHub",
    "77": "TelecomCustomerService",
    "78": "TelecomOps",
    "79": "WAP",
    "80": "WalkMe",
    "81": "WebContentMgmtServices",
    "82": "WorkstationLifecycle",
    "83": "Zoom",
    "84": "iClickers"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "ADIS": 0,
    "ADV": 1,
    "AP": 2,
    "ATS-SIC": 3,
    "AcademicTechInnovation": 4,
    "AudioVisualDesign": 5,
    "BARS": 6,
    "BIA": 7,
    "BusinessIntelligence": 8,
    "CIOPS": 9,
    "Canvas": 10,
    "ClassroomSupport": 11,
    "CloudInfrastructure": 12,
    "CloudLabs": 13,
    "CollabSupport": 14,
    "CommunicationsAndOutreach": 15,
    "CoreBusinessApps": 16,
    "DataCenterTPC": 17,
    "DataIntegrationServices": 18,
    "DataMgmt": 19,
    "Datacomm": 20,
    "DigitalSignage": 21,
    "DuoSupport": 22,
    "ESignature": 23,
    "ETS-PodcastAdmin": 24,
    "ETS-SIC": 25,
    "EducationalInfrastructureSystems": 26,
    "EnrollmentManagement": 27,
    "EnterpriseSoftwareLicensing": 28,
    "FIM": 29,
    "FIS": 30,
    "FIS-Config": 31,
    "FieldSupport-Intake": 32,
    "HCM": 33,
    "HDH": 34,
    "Hostmaster": 35,
    "IAM-LastPass": 36,
    "ISSM": 37,
    "InstallationRepair": 38,
    "InstructionalComputingServices": 39,
    "Interfolio": 40,
    "KalturaVideo": 41,
    "KualiBuild": 42,
    "Library": 43,
    "MainFrame": 44,
    "MediaEvent": 45,
    "MessagingCollaboration": 46,
    "MultimediaServices": 47,
    "MyMobileBill": 48,
    "NetIntegrationServices": 49,
    "NetworkArchitecture": 50,
    "OIA-ADTeam": 51,
    "OIA-IAM-AccessProv": 52,
    "OIA-IAM-ShibSupport": 53,
    "OnBase": 54,
    "OnBase-PRA": 55,
    "OpenEdX-Online": 56,
    "Outsideplant-NodeRoom": 57,
    "ProSupport": 58,
    "ProductionControl": 59,
    "ProjectPortfolioMgmtOffice": 60,
    "Qualtrics": 61,
    "RIS": 62,
    "RMP": 63,
    "ResearchITServices": 64,
    "SDMI": 65,
    "SIS-AcademicAffairs": 66,
    "SIS-AcademicAffairs-ISA": 67,
    "SIS-ExIS": 68,
    "SIS-StudentAffairs": 69,
    "SNOW": 70,
    "SecuritySOC": 71,
    "ServiceDesk": 72,
    "ServiceOps": 73,
    "SharePointSupport": 74,
    "Splunk": 75,
    "TechHub": 76,
    "TelecomCustomerService": 77,
    "TelecomOps": 78,
    "WAP": 79,
    "WalkMe": 80,
    "WebContentMgmtServices": 81,
    "WorkstationLifecycle": 82,
    "Zoom": 83,
    "iClickers": 84
  },
  "layer_norm_eps": 1e-07,
  "max_position_embeddings": 512,
  "max_relative_positions": -1,
  "model_type": "deberta-v2",
  "norm_rel_ebd": "layer_norm",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_dropout": 0,
  "pooler_hidden_act": "gelu",
  "pooler_hidden_size": 768,
  "pos_att_type": [
    "p2c",
    "c2p"
  ],
  "position_biased_input": false,
  "position_buckets": 256,
  "relative_attention": true,
  "share_att_key": true,
  "torch_dtype": "float32",
  "transformers_version": "4.30.2",
  "type_vocab_size": 0,
  "vocab_size": 128100
}
